menu = ['1. 학생탈퇴', '2. 추가등록 ', '3. 학생목록 ', '4. 합격생목록 ', '5. 불합격생목록','6. 탈퇴목록','9. 메뉴종료 ']
menuChk = []
itemList = ['ID','필기점수','실기점수','인성점수']
MenuList = ["ID", "필기", "실기" ,"인성","합계","평균","합격유무"]

idList = ["Orange", "Red", "Yellow", "Green", "Blue", "Navy", "Purple"];

# -----------------------------------------------------------------------------------------------------------------------
funList = ['', 'stuDel()', 'stuIns()', 'stuSel()', 'stuPass()', 'stuNonPass()', 'stuDelSel()' ] 
# -----------------------------------------------------------------------------------------------------------------------
scoreList = [[47, 58, 85],[12, 75, 84],[57, 75, 84],[36, 86, 87],
      [89, 67, 46],[45, 86, 46],[68, 47, 98]];

dic = {}
deleteIDList = {}
idx = 0;


for menu2 in range(len(menu)):
	menuChk.append(menu[menu2][0])
print(menuChk)


#-학생관리시스템-----------------------------------------------------------------------------------------
def stuTitle():
	print("="*115)
	print("{0:^110}".format(">>학생관리시스템v01<<"))
	print("="*115)
	for vMenu in menu:
		print("   ",vMenu, end="")
	print("\n")
	print("="*115)

#-학생탈퇴-----------------------------------------------------------------------------------------
def stuDel():
	print()
	print("{0:^90}".format("1. 학생탈퇴 Algorithm Chk"))
	print()

#-추가등록-----------------------------------------------------------------------------------------
def stuIns():
	print()
	print("{0:^90}".format("2. 추가등록 Algorithm Chk"))
	print()

#-학생목록-----------------------------------------------------------------------------------------
def stuSel():
	print()
	print("{0:^90}".format("3. 학생목록 Algorithm Chk"))
	print()

#-합격생목록-----------------------------------------------------------------------------------------
def stuPass():
	print()
	print("{0:^90}".format("4. 합격생 목록 Algorithm Chk"))
	print()

#-불합격생목록-----------------------------------------------------------------------------------------
def stuNonPass():
	print()
	print("{0:^90}".format("5. 불합격생 목록 Algorithm Chk"))
	print()

#-탈퇴목록-----------------------------------------------------------------------------------------
def stuDelSel():
	print()
	print("{0:^90}".format("6. 탈퇴목록 Algorithm Chk"))
	print()
#-학생관리시스템-----------------------------------------------------------------------------------------
while True:
	stuTitle()
	
#-9-----------------------------------------------------------------------------------------

	print("\n\n")
	num=int(input("{0:^50}".format("번호입력:")))
	print()
	if num==9:
		print("{0:^90}".format("종료합니다."))
		print()
		break
	elif num in range(len(menuChk)):
		eval(funList[num])
	else:
		print("{0:^90}".format("다시 입력해주세요"))
		print()